openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Mcu.c
	/* Set Recover Vector */
#if defined(CFG_MPC5516)

	WRITE32(CRP_Z1VEC, ((uint32)&McuE_LowPowerRecoverFlash) | VLE_VAL );
	READWRITE32( CRP_RECPTR, RECPTR_FASTREC, 0 );

	Mcu_SavedHaltFlags = SIU.HLT.R;
	/* Halt everything */
	SIU.HLT.R = 0x3FFFFFFF;
	while((SIU.HLTACK.R != 0x3FFFFFFF) && (timeout<3000)) {}

	/* put Z0 in reset if not used for wakeup */
	CRP.Z0VEC.B.Z0RST = 1;

#elif defined(CFG_MPC5668)

	WRITE32(CRP_Z6VEC, ((uint32)&McuE_LowPowerRecoverFlash) | VLE_VAL );
	READWRITE32(CRP_RECPTR,RECPTR_FASTREC,0 );

	Mcu_SavedHaltFlags[0] = SIU.HLT0.R;
	Mcu_SavedHaltFlags[1] = SIU.HLT1.R;
	/* Halt everything */
    SIU.HLT0.R = 0x037FFF3D;
    SIU.HLT1.R = 0x18000F3C;
    while((SIU.HLTACK0.R != 0x037FFF3D) && (SIU.HLTACK1.R != 0x18000F3C) && (timeout<3000)){}
#else
#error CPU not defined
#endif

	/* put Z0 in reset if not used for wakeup */
	CRP.Z0VEC.B.Z0RST = 1;

    /* Save context and execute wait instruction.
	 *
	 * Things that matter here are
	 * - Z1VEC, determines where TLB0 will point. TLB0 is written with a
	 *   value at startup that 4K aligned to this address.
	 * - LowPower_Sleep() will save a interrupt context so we will return
	 *   intact.
	 * - For devices with little RAM we don't want to impose the alignment
	 *   requirements there. Almost as we have to occupy a 4K block for this..
	 *   although the code does not take that much space.
	 * */
	McuE_EnterLowPower(mcuMode);

    /* Clear sleep flags to allow pads to operate */
    CRP.PSCR.B.SLEEPF = 0x1;
}

#endif

void Mcu_SetMode( Mcu_ModeType mcuMode)
{
	VALIDATE( ( 1 == Mcu_Global.initRun ), MCU_SETMODE_SERVICE_ID, MCU_E_UNINIT );
	// VALIDATE( ( McuMode <= Mcu_Global.config->McuNumberOfMcuModes ), MCU_SETMODE_SERVICE_ID, MCU_E_PARAM_MODE );


#if defined(CFG_MPC5516) || defined(CFG_MPC5668)
	if( MCU_MODE_RUN == mcuMode ) {

		/* Get back to "normal" halt flags */
#if defined(CFG_MPC5516)
		SIU.HLT.R = Mcu_SavedHaltFlags;
#elif defined(CFG_MPC5668)
		SIU.HLT0.R = Mcu_SavedHaltFlags[0];
		SIU.HLT1.R = Mcu_SavedHaltFlags[1];
#endif

	} else if( MCU_MODE_SLEEP == mcuMode ) {
		/*
		 * Follows the AN3548 from Freescale
		 *
		 */
#if defined(USE_DMA)
		Dma_DeInit();
#endif


		/* Set system clock to 16Mhz IRC */
		SIU.SYSCLK.B.SYSCLKSEL = 0;

		/* Put flash in low-power mode */
		// TODO

		/* Put QQADC in low-power mode */
		// TODO

		/* Set us in SLEEP mode */
		CRP.PSCR.B.SLEEP = 1;


		enterLowPower(mcuMode);
	}
#else
	/* NOT SUPPORTED */
	(void) mcuMode;
#endif
}

//-------------------------------------------------------------------

/**
 * Get the system clock in Hz. It calculates the clock from the
 * different register settings in HW.
 */
uint32_t McuE_GetSystemClock(void)
{
	/*
	 * System clock calculation
	 *
	 * 5516 -  f_sys = extal * (emfd+16) / ( (eprediv+1) * ( erfd+1 ));
	 * 5567 -  f_sys = extal * (emfd+4) / ( (eprediv+1) * ( 2^erfd ));
	 * 563x -  We run in legacy mode = 5567
	 * 5606s - f_sys = extal * emfd / ((eprediv+1)*(2<<(erfd)));
	 */
#if defined(CFG_MPC5516) || defined(CFG_MPC5668)
	uint32_t eprediv = FMPLL.ESYNCR1.B.EPREDIV;
	uint32_t emfd = FMPLL.ESYNCR1.B.EMFD;
	uint32_t erfd = FMPLL.ESYNCR2.B.ERFD;
#elif defined(CFG_MPC5554) || defined(CFG_MPC5567) || defined(CFG_MPC5633)
	uint32_t eprediv = FMPLL.SYNCR.B.PREDIV;
	uint32_t emfd = FMPLL.SYNCR.B.MFD;
	uint32_t erfd = FMPLL.SYNCR.B.RFD;
#elif defined(CFG_MPC560XB)
    uint32_t eprediv = CGM.FMPLL_CR.B.IDF;
    uint32_t emfd = CGM.FMPLL_CR.B.NDIV;
    uint32_t erfd = CGM.FMPLL_CR.B.ODF;
#elif defined(CFG_MPC5606S)
    uint32_t eprediv = CGM.FMPLL[0].CR.B.IDF;
    uint32_t emfd = CGM.FMPLL[0].CR.B.NDIV;
    uint32_t erfd = CGM.FMPLL[0].CR.B.ODF;
#endif

    uint32_t f_sys;
    uint32  extal = Mcu_Global.config->McuClockSettingConfig[Mcu_Global.clockSetting].McuClockReferencePointFrequency;

    f_sys = CALC_SYSTEM_CLOCK(extal,emfd,eprediv,erfd);

    return f_sys;
}

#if defined(CFG_MPC5668)
uint32_t McuE_GetPeripheralClock(McuE_PeriperalClock_t type) {
	uint32_t sysClock = McuE_GetSystemClock();
	vuint32_t prescaler;

	switch (type)
	{
		case PERIPHERAL_CLOCK_FLEXCAN_A:
		case PERIPHERAL_CLOCK_FLEXCAN_B:
		case PERIPHERAL_CLOCK_FLEXCAN_C:
		case PERIPHERAL_CLOCK_FLEXCAN_D:
		case PERIPHERAL_CLOCK_FLEXCAN_E:
		case PERIPHERAL_CLOCK_FLEXCAN_F:
		case PERIPHERAL_CLOCK_DSPI_A:
		case PERIPHERAL_CLOCK_DSPI_B:
		case PERIPHERAL_CLOCK_DSPI_C:
		case PERIPHERAL_CLOCK_DSPI_D:
			prescaler = SIU.SYSCLK.B.LPCLKDIV1;
			break;
		case PERIPHERAL_CLOCK_ESCI_A:
		case PERIPHERAL_CLOCK_ESCI_B:
		case PERIPHERAL_CLOCK_ESCI_C:
		case PERIPHERAL_CLOCK_ESCI_D:
		case PERIPHERAL_CLOCK_ESCI_E:
		case PERIPHERAL_CLOCK_ESCI_F:
		case PERIPHERAL_CLOCK_IIC_A:
		case PERIPHERAL_CLOCK_IIC_B:
			prescaler = SIU.SYSCLK.B.LPCLKDIV0;
			break;
		case PERIPHERAL_CLOCK_ADC_A:
			prescaler = SIU.SYSCLK.B.LPCLKDIV2;
			break;
		case PERIPHERAL_CLOCK_EMIOS:
			prescaler = SIU.SYSCLK.B.LPCLKDIV3;
			break;
		default:
			assert(0);
			break;
	}

	return sysClock/(1<<prescaler);

}

#else

/**
 * Get the peripheral clock in Hz for a specific device
 */
uint32_t McuE_GetPeripheralClock(McuE_PeriperalClock_t type)
{
#if defined(CFG_MPC5567)
	// No peripheral dividers on 5567.
	return McuE_GetSystemClock();
#else
	uint32_t sysClock = McuE_GetSystemClock();
	vuint32_t prescaler;

  // See table 3.1, section 3.4.5 Peripheral Clock dividers
	switch (type)
	{
		case PERIPHERAL_CLOCK_FLEXCAN_A:
		case PERIPHERAL_CLOCK_DSPI_A:
#if defined(CFG_MPC5516)
			prescaler = SIU.SYSCLK.B.LPCLKDIV0;
			break;
#elif defined(CFG_MPC560X)
			prescaler = CGM.SC_DC[1].B.DIV;
			break;
#endif

		case PERIPHERAL_CLOCK_PIT:
		case PERIPHERAL_CLOCK_ESCI_A:
		case PERIPHERAL_CLOCK_IIC_A:
#if defined(CFG_MPC5516)
			prescaler = SIU.SYSCLK.B.LPCLKDIV1;
			break;
#endif

		case PERIPHERAL_CLOCK_FLEXCAN_B:
		case PERIPHERAL_CLOCK_FLEXCAN_C:
		case PERIPHERAL_CLOCK_FLEXCAN_D:
		case PERIPHERAL_CLOCK_FLEXCAN_E:
		case PERIPHERAL_CLOCK_FLEXCAN_F:
#if defined(CFG_MPC5516)
			prescaler = SIU.SYSCLK.B.LPCLKDIV2;
			break;
#elif defined(CFG_MPC560X)
			prescaler = CGM.SC_DC[1].B.DIV;
			break;
#endif

		case PERIPHERAL_CLOCK_DSPI_B:
		case PERIPHERAL_CLOCK_DSPI_C:
		case PERIPHERAL_CLOCK_DSPI_D:
		case PERIPHERAL_CLOCK_DSPI_E:
		case PERIPHERAL_CLOCK_DSPI_F:
#if defined(CFG_MPC5516)
		prescaler = SIU.SYSCLK.B.LPCLKDIV3;
			break;
#endif

